src/Catalogs/ТелефонныеАппараты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ТелефонныеАппараты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязанКСотрудникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрослушатьЗаписьРазговоров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыПривязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ТелефонныеАппараты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	УстановитьПодсказку();
	Элементы.СегментСотрудников.Видимость = Объект.ПрослушатьЗаписьРазговоров;	
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриЧтенииНаСервере".
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед записью.
//
// Параметры:
//  Отказ			 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ПрослушатьЗаписьРазговоров 
		И Не ЗначениеЗаполнено(Объект.СегментСотрудников) Тогда 		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран сегмент сотрудников!'; en = 'No employee segment selected!'"));		
		Отказ = Истина;
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриЗаписиНаСервере".
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ПривязанКСотрудникамПриИзменении(Элемент)
	
	Если Объект.ОбъектыПривязки.Количество() > 0 Тогда
		Наименование = ?(Объект.ПривязанКСотрудникам, "рабочих мест", "сотрудников");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПривязанКСотрудникамЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, СтрШаблон(НСтр("ru='Список %1 будет очищен, продолжить?';en='List %1 willbe cleared continue?'"), Наименование), РежимДиалогаВопрос.ДаНет,,,НСтр("ru='Внимание!';en='Attention!'"));
	Иначе
		УстановитьПодсказку();
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события завершения.
//
Процедура ПривязанКСотрудникамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ОбъектыПривязки.Очистить();
		УстановитьПодсказку();
	Иначе
		Объект.ПривязанКСотрудникам = Не Объект.ПривязанКСотрудникам;	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора".
//
Процедура РабочиеМестаРабочееМестоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ПривязанКСотрудникам Тогда
		Элементы.ОбъектыПривязки.ТекущиеДанные.Объект = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	Иначе
		Элементы.ОбъектыПривязки.ТекущиеДанные.Объект = ПредопределенноеЗначение("Справочник.РабочиеМеста.ПустаяСсылка");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Прослушать запись разговоров при изменении
//
Процедура ПрослушатьЗаписьРазговоровПриИзменении(Элемент) 	
	
	Если Не Объект.ПрослушатьЗаписьРазговоров Тогда		
		Объект.СегментСотрудников = Неопределено; 		
	КонецЕсли; 	
	
	Элементы.СегментСотрудников.Видимость = Объект.ПрослушатьЗаписьРазговоров;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, устанавливает видимость элементов на форме.
//
Процедура УстановитьПодсказку()
	
	Если Объект.ПривязанКСотрудникам Тогда
		Элементы.ПривязанКСотрудникам.Подсказка = НСтр("ru= 'Данный режим следует использовать если номер телефона привязан к сотруднику и он может работать с разных компьютеров';en= 'This mode should be used if the phone number is tied to an employee and it can work from different computers'");
	Иначе
		Элементы.ПривязанКСотрудникам.Подсказка = НСтр("ru= 'Данный режим следует использовать, когда используется стационарный телефон, закрепленный за компьютером на котором работают разные сотрудники';en= 'This mode should be used when using a landline telephone attached to a computer on which different employees work'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
